package Level_1.Part_3.Tasc_2;
/*
Создать класс, спецификация которого приведена ниже.
Определить конструктор и методы setТип(), getТип(), showИнформ().
Реализовать класс в консольном приложении.
Определить дополнительно методы в классе, создающем массив объектов.
Задать критерий выбора данных и вывести эти данные на консоль.
Student: id, Фамилия, Имя, Отчество, Дата рождения, Адрес,
Телефон, Факультет, Курс, Группа.
Создать массив объектов. Вывести:
1 список студентов заданного факультета;
2 списки студентов для каждого факультета и курса;
3 список студентов, родившихся после заданного года;
4 список учебной группы.
 */
public class Student {
}
